module.exports= {
    notEmpty: "يجب الا يكون الحقل فارغ",
    isPhoneNumber: "يجب ادخال رقم صحيح",
    isEmail: "يجب ادخال بريد الكتروني صحيح",
    isVerificationCode: "يجب ادخال رمز تحقق صحيح",
    isExpiredDate: "يرجي ادخال توقيت حديث",
    isNumber: "يجب ان يحتوي علي ارقام",
    confirmPassword:  "كلمة المرور غير متطابقة",
    arrayLength:  (min, max) => ` عدد الخدمات الاضافية المتاحة لكل حجز يجب ان يكون من بين ${min} الي ${max} خدمة`,
    passwordMinLength: `يجب ان لا تقل كلمة المرور عن 8 حروف`,
    weekPassword: "كلمة مرور ضعيفة يجب ان تحتوي علي ارقام وحروف صغيرة وكبيرة ورموز",
    noFileUploaded: "يجب اختيار صورة",
    isArray: "يجب ان يحتوي هذا الحقل علي عنصر واحد او مجموعة من العناصر",
    isUnique: "هذا الحقل مستخدم من قبل, يجب ادخال قيمة اخري",
    invalidLengthGiftMessage: "يجب ان يكون عدد حروف الرسالة اكتر من عشرة حروف واقل من مئة حرف"
}